import moji from 'moji';

const smallCharMap = new Map<string, string>([
    ['ぁ', 'あ'],
    ['ぃ', 'い'],
    ['ぅ', 'う'],
    ['ぇ', 'え'],
    ['ぉ', 'お'],
    // ['っ', 'つ'],
    ['ゃ', 'や'],
    ['ゅ', 'ゆ'],
    ['ょ', 'よ'],
    ['ゎ', 'わ'],
    ['ゕ', 'か'],
    ['ゖ', 'け'],
    ['ァ', 'ア'],
    ['ィ', 'イ'],
    ['ゥ', 'ウ'],
    ['ェ', 'エ'],
    ['ォ', 'オ'],
    ['ヵ', 'カ'],
    ['ㇰ', 'ク'],
    ['ヶ', 'ケ'],
    ['ㇱ', 'シ'],
    ['ㇲ', 'ス'],
    // ['ッ', 'ツ'],
    ['ㇳ', 'ト'],
    ['ㇴ', 'ヌ'],
    ['ㇵ', 'ハ'],
    ['ㇶ', 'ヒ'],
    ['ㇷ', 'フ'],
    ['ㇷ゚', 'プ'],
    ['ㇸ', 'へ'],
    ['ㇹ', 'ホ'],
    ['ㇺ', 'ム'],
    ['ャ', 'ヤ'],
    ['ュ', 'ユ'],
    ['ョ', 'ヨ'],
    ['ㇻ', 'ラ'],
    ['ㇼ', 'リ'],
    ['ㇽ', 'ル'],
    ['ㇾ', 'レ'],
    ['ㇿ', 'ロ'],
    ['ヮ', 'ワ'],
]);

export default function toHiragana(str: string): string {
    // 小文字を大文字に変換
    const _t = str
        .split('')
        .map((c) => smallCharMap.get(c) ?? c)
        .join('');
    return moji(_t).convert('HK', 'ZK').convert('KK', 'HG').toString();
}
